In [68]:
import pandas as pd
import numpy as np
import math

### Organizing dataframe

In [48]:
df = pd.read_csv("jacobs_capes/cse_capes.csv", usecols= ['Instructor','Rcmnd Instr'])

In [49]:
df['Rcmnd Instr'] = df['Rcmnd Instr'].str.rstrip('%').astype('float') / 100.0

In [50]:
women_profs = ['Heninger, Nadia A', 'Rosing, Tajana Simunic', 'Chaudhuri, Kamalika', 'Alvarado, Christine J.', 'Minnes Kemp, Mor Mia', 'Polikarpova, Nadezhda', 'Esmaeilzadeh, Hadi', 'Riek, Laurel D', 'Gymrek, Melissa Ann', 'Chaudhuri, Kamalika', 'Nakashole, Ndapandula', 'Zaitsev, Anna L', 'Altintas De Callaf, Ilkay']

In [51]:
df['Gender'] = np.where(df['Instructor'].isin(women_profs), "Woman", "Man")

In [52]:
df.head()

                 Instructor  Rcmnd Instr Gender
0  Moshiri, Alexander Niema        0.983    Man
1        Kane, Daniel Mertz        0.946    Man
2            Jones, Miles E        0.961    Man
3       Meyer, Kyle Phillip        0.530    Man
4       Meyer, Kyle Phillip        0.630    Man

In [53]:
df.loc[20]

Instructor     Rosing, Tajana Simunic
Rcmnd Instr                     0.801
Gender                          Woman
Name: 20, dtype: object

### Z-test

https://www.statisticshowto.com/probability-and-statistics/hypothesis-testing/z-test/

##### Defining recommended: > 75

In [54]:
#z-test
df['Gender'].value_counts()

Man      2214
Woman     188
Name: Gender, dtype: int64

In [64]:
num_women = 188
num_men = 2214

#num women recommended/total women
p1 = 163/num_women
p2 = 1741/num_men
print("P1: ", p1)
print("P2: ", p2)

P1:  0.8670212765957447
P2:  0.7863595302619693

In [65]:
#overall proportion
p = (163+1741)/(188+2214)
print("P: ", p)

P:  0.7926727726894255

In [66]:
df.loc[(df['Rcmnd Instr'] > 0.75) & (df['Gender'] == "Woman")]

                  Instructor  Rcmnd Instr Gender
15         Heninger, Nadia A        0.868  Woman
20    Rosing, Tajana Simunic        0.801  Woman
25       Chaudhuri, Kamalika        0.826  Woman
38    Alvarado, Christine J.        1.000  Woman
39      Minnes Kemp, Mor Mia        1.000  Woman
...                      ...          ...    ...
1790     Chaudhuri, Kamalika        0.906  Woman
2016  Rosing, Tajana Simunic        0.774  Woman
2051  Rosing, Tajana Simunic        0.810  Woman
2193  Rosing, Tajana Simunic        0.955  Woman
2194  Rosing, Tajana Simunic        0.895  Woman

[163 rows x 3 columns]

In [70]:
#z-test formula
z = ((p1-p2)-0)/math.sqrt((p*(1-p))*((1/num_women)+(1/num_men)))
z

2.6192304518614566

In [72]:
# z-score associated with a 5% alpha level / 2 is 1.96.
# 2.619 > 1.96, reject the null hypothesis (so proportions are not the same)

### T-test

https://www.statisticshowto.com/probability-and-statistics/t-test/ 

https://www.statisticshowto.com/probability-and-statistics/t-distribution/independent-samples-t-test/

In [73]:
# idk